In [2]:
import json
import os
import sys
import psycopg2
from pathlib import Path
import pandas as pd  
from shared_functions import *

In [3]:
table_product_sales_detail = "product_sales_detail"
schema_prd = "prd"

In [19]:
query_best_sells = f"""
    SELECT product_id, product_name, SUM(quantity) as quantity
    FROM {schema_prd}.{table_product_sales_detail} 
    GROUP BY product_id, product_name
    ORDER BY quantity DESC;
"""
df_best_sells = get_from_postgres(query_best_sells)

In [20]:
df_best_sells

  product_id product_name  quantity
0       P001    Product 1        15
1       P003    Product 3         6
2       P002    Product 2         4

In [23]:
query_average_value = f"""
    SELECT customer_id, AVG(total_price) as average_order_value
    FROM {schema_prd}.{table_product_sales_detail} 
    GROUP BY customer_id
    ORDER BY customer_id ASC;
"""
df_average_value = get_from_postgres(query_average_value)

In [24]:
df_average_value

  customer_id  average_order_value
0        C001                700.0
1        C002                600.0
2        C003                600.0

In [25]:
query_total_revenue = f"""
    SELECT category, SUM(total_price) as total_revenue
    FROM {schema_prd}.{table_product_sales_detail} 
    GROUP BY category
    ORDER BY category ASC;
"""
df_total_revenue = get_from_postgres(query_total_revenue)

In [26]:
df_total_revenue

     category  total_revenue
0  Category A         2400.0
1  Category B          800.0